In [3]:
met = 0
while met < 10:
    met = met + 1
    print(met)

1
2
3
4
5
6
7
8
9
10

In [4]:
sum = 0
while True:
    n = int(input("Δωστε εναν θετικο αριθμο (-1 για τέλος):"))
    if n == -1:
        break;
    sum = sum + n
print("Αθροισμα =", sum)

Δωστε εναν θετικο αριθμο (-1 για τέλος):5
Δωστε εναν θετικο αριθμο (-1 για τέλος):5
Δωστε εναν θετικο αριθμο (-1 για τέλος):5
Δωστε εναν θετικο αριθμο (-1 για τέλος):-1
Αθροισμα = 15

In [5]:
fruit = "mhlo"
met = 0
while met < len(fruit):
    letter = fruit[met]
    print(letter)
    met = met + 1

m
h
l
o

In [6]:
for name in "Bod", "Alice":
    print(name)

Bod
Alice

In [7]:
for i in range(10):
    print(i)

0
1
2
3
4
5
6
7
8
9

In [8]:
for i in 5,6,7:
    print(i)

5
6
7

In [9]:
for i in range(100, 120):
    print(i, end=" ")

100 101 102 103 104 105 106 107 108 109 110 111 112 113 114 115 116 117 118 119

In [10]:
for i in range(10):
    print(i)
    print("hello")

0
hello
1
hello
2
hello
3
hello
4
hello
5
hello
6
hello
7
hello
8
hello
9
hello

In [13]:
import numpy as np
import pandas as pd

labels = ["First", "Second", "Third"] #Lista me strings
values = [10, 20, 30] #Lista me arithmous
array = np.arange(10,31,10) #numpy array
dico = {"First":10, "Second":20, "Third":30} #ena leksiko

In [16]:
#Creating Series
A = pd.Series(values) #We add values 
A #Show series

0    10
1    20
2    30
dtype: int64

In [17]:
B = pd.Series(values, labels)
B

First     10
Second    20
Third     30
dtype: int64

In [18]:
C = pd.Series(array, labels)
C

First     10
Second    20
Third     30
dtype: int32

In [19]:
D = pd.Series(dico)
D

First     10
Second    20
Third     30
dtype: int64

In [20]:
pd.Series(labels, values)

10     First
20    Second
30     Third
dtype: object

In [21]:
A = pd.Series([1,2,3,4], ['Smart', 'Opel', 'Audi', 'Porsche'])
A

Smart      1
Opel       2
Audi       3
Porsche    4
dtype: int64

In [27]:
print("Εμφανιση του πρωτου στοιχειου")
A['Smart']

Εμφανιση του πρωτου στοιχειου

1

In [28]:
A1 = pd.Series(['Smart', 'Opel', 'Audi', 'Porsche'], [1,2,3,4])
A1

1      Smart
2       Opel
3       Audi
4    Porsche
dtype: object

In [29]:
print("Εμφανιση του πρωτου στοιχειου")
A1[1]

Εμφανιση του πρωτου στοιχειου

'Smart'

In [31]:
double_A = A + A
double_A

Smart      2
Opel       4
Audi       6
Porsche    8
dtype: int64

In [33]:
A = pd.Series([1,2,3,4], ['Smart', 'Opel', 'Audi', 'Porsche'])
A3 = pd.Series([1,2,3,4], ['Fiat', 'Opel', 'Audi', 'Porsche'])
add_AA3 = A + A3
add_AA3

Audi       6.0
Fiat       NaN
Opel       4.0
Porsche    8.0
Smart      NaN
dtype: float64

In [35]:
S1 = pd.Series([1,2,3,4], ['Smart', 'Opel', 'Audi', 'Porsche'])
df1 = pd.DataFrame([S1])
df1

   Smart  Opel  Audi  Porsche
0      1     2     3        4

In [37]:
S2 = pd.Series([10,20,30,40], ['Smart', 'Opel', 'Audi', 'Porsche'])
index = "Row1 Row2".split() #methodos diaxwrismoy symboloseiras .split()
df2 = pd.DataFrame([S1, S2], index)
df2

      Smart  Opel  Audi  Porsche
Row1      1     2     3        4
Row2     10    20    30       40

In [40]:
email = "testuser@hotmail.com"
mail_list = email.split("@")
mail_list

['testuser', 'hotmail.com']

In [43]:
Array = np.arange(1,21).reshape(5,4)
row = "Row1 Row2 Row3 Row4 Row5".split()
col = "Col1 Col2 Col3 Col4".split()
df3 = pd.DataFrame(Array, row, col)
df3

      Col1  Col2  Col3  Col4
Row1     1     2     3     4
Row2     5     6     7     8
Row3     9    10    11    12
Row4    13    14    15    16
Row5    17    18    19    20

In [44]:
df3["Col1"]

Row1     1
Row2     5
Row3     9
Row4    13
Row5    17
Name: Col1, dtype: int32

In [45]:
df3[["Col1", "Col2"]]

      Col1  Col2
Row1     1     2
Row2     5     6
Row3     9    10
Row4    13    14
Row5    17    18

In [46]:
df3['Col2']["Row5"]

18

In [47]:
df3.loc["Row1"]

Col1    1
Col2    2
Col3    3
Col4    4
Name: Row1, dtype: int32

In [48]:
df3.iloc[0]

Col1    1
Col2    2
Col3    3
Col4    4
Name: Row1, dtype: int32

In [52]:
df3.loc["Row1"]["Col1"]

1

In [53]:
df3.iloc[0]["Col1"]

1

In [55]:
df3["Col sum"] = df3['Col1'] + df3['Col2']
df3

      Col1  Col2  Col3  Col4  Col sum
Row1     1     2     3     4        3
Row2     5     6     7     8       11
Row3     9    10    11    12       19
Row4    13    14    15    16       27
Row5    17    18    19    20       35

In [56]:
df3['New column'] = np.zeros(5)
df3

      Col1  Col2  Col3  Col4  Col sum  New column
Row1     1     2     3     4        3         0.0
Row2     5     6     7     8       11         0.0
Row3     9    10    11    12       19         0.0
Row4    13    14    15    16       27         0.0
Row5    17    18    19    20       35         0.0

In [57]:
df3.drop('New column', axis = 1, inplace = True)
df3

      Col1  Col2  Col3  Col4  Col sum
Row1     1     2     3     4        3
Row2     5     6     7     8       11
Row3     9    10    11    12       19
Row4    13    14    15    16       27
Row5    17    18    19    20       35